#include <iostream>
#include <vector>
#include <cmath>
#include <iomanip>
using namespace std;

// Коэффициенты системы
double a, b, c, d;
// Параметры системы
double усиление, врем_пост_0, врем_задерж, врем_пост, жел_выход;
// Параметры регулятора
double рег_0, рег_1, рег_2;

void нелинейная_система() {
    // Начальные параметры
    const short int нач_выход = 2;
    vector<double> выход = { нач_выход, нач_выход };
    double упр_сигнал = 1.0;
    vector<double> ошибка = { жел_выход - нач_выход, жел_выход - нач_выход };
    vector<double> пред_упр_сигнал = {упр_сигнал, упр_сигнал};

    while (abs(жел_выход - выход.back()) > 0.01) {
        ошибка.push_back(жел_выход - выход.back());
        упр_сигнал = пред_упр_сигнал.back() + рег_0 * ошибка.back() + рег_1 * ошибка[ошибка.size() - 2] + рег_2 * ошибка[ошибка.size() - 3];
        выход.push_back(a * выход.back() - b * выход[выход.size() - 2] + c * упр_сигнал + d * sin(пред_упр_сигнал.back()));
        пред_упр_сигнал.push_back(упр_сигнал);
    }

    cout << setfill('-') << setw(55) << "-" << endl;
    cout << setfill(' ');
    cout << "| " << setw(4) << "Шаг" << " | " 
         << setw(10) << "Выход" << " | " 
         << setw(10) << "Ошибка" << " | " 
         << setw(15) << "Упр. сигнал" << " |" << endl;
    cout << setfill('-') << setw(55) << "-" << endl;
    cout << setfill(' ');

    for (int i = 0; i < выход.size(); i++) {
        cout << "| " << setw(4) << i + 1 << " | "
             << fixed << setprecision(4)
             << setw(10) << выход[i] << " | "
             << setw(10) << ошибка[i] << " | "
             << setw(15) << пред_упр_сигнал[i] << " |" << endl;
    }
    cout << setfill('-') << setw(55) << "-" << endl;
}

int main() {
    setlocale(LC_ALL, "RU");
    cout << "Введите коэффициенты системы:\n";
    cout << "a: "; cin >> a;
    cout << "b: "; cin >> b;
    cout << "c: "; cin >> c;
    cout << "d: "; cin >> d;

    cout << "Введите параметры системы:\n";
    cout << "усиление: "; cin >> усиление;
    cout << "врем_пост_0: "; cin >> врем_пост_0;
    cout << "врем_задерж: "; cin >> врем_задерж;
    cout << "врем_пост: "; cin >> врем_пост;
    cout << "жел_выход (желаемое значение выхода): "; cin >> жел_выход;

    рег_0 = усиление * (1 + (врем_задерж / врем_пост_0));
    рег_1 = -усиление * (1 + 2 * (врем_задерж / врем_пост_0) - (врем_пост_0 / врем_пост));
    рег_2 = усиление * (врем_задерж / врем_пост_0);

    нелинейная_система();
    return 0;
}
