#include <iostream>
#include <cmath>

using namespace std;

const double коэффициент_a = 1.0;
const double коэффициент_b = 0.5;
const double коэффициент_c = 0.1;
const double коэффициент_d = 0.9;
const double U = 1.5;

void процессЛинейка(double& длина, int итерации);
void процессНеЛинейка(double& температура, int итерации);

int main() {
    setlocale(LC_ALL, "rus");
    double начальнаяТемпература = 0;

    cout << "какая начальная температура? ";
    cin >> начальнаяТемпература;

    // Процесс линейной модели
    процессЛинейка(начальнаяТемпература, 10);

    // Процесс нелинейной модели
    процессНеЛинейка(начальнаяТемпература, 10);

    return 0;
}

void процессЛинейка(double& длина, int итерации) {
    cout << "линейная модель:" << endl;
    for (int i = 0; i < итерации; i++) {
        длина = коэффициент_a * длина + коэффициент_b * U;
        cout << "////" << длина << "////" << endl;
    }
}

void процессНеЛинейка(double& температура, int итерации) {
    double предыдущаяТемпература = температура;
    bool перваяИтерация = true;

    cout << "нелинейная модель:" << endl;
    for (int i = 0; i < итерации; i++) {
        if (перваяИтерация) {
            температура = коэффициент_a * температура + коэффициент_c * U + коэффициент_d * sin(U);
            перваяИтерация = false;
        } else {
            double новаяТемпература = коэффициент_a * температура - коэффициент_b * pow(предыдущаяТемпература, 2) + коэффициент_c * U + коэффициент_d * sin(U);
            предыдущаяТемпература = температура;
            температура = новаяТемпература;
        }
        cout << "////" << температура << "////" << endl;
    }
}